---
kind: property
id: P:Autodesk.Revit.UI.Macros.UIMacroManager.MacroManager
source: html/6fb1a5e4-e86d-2a31-4f2b-e0dde282143d.htm
---
# Autodesk.Revit.UI.Macros.UIMacroManager.MacroManager Property

The DB macro manager.

## Syntax (C#)
```csharp
public MacroManager MacroManager { get; }
```